XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF2xx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
	<vendor>Sinowealth</vendor>
	<name>SH3xF2xx_DFP</name>
	<description>Sinowealth SH3xF2xx Device Family Pack</description>
	<url>http://www.sinowealth.com/Tools/ARM32/</url>

	<releases>
		<release version="2.4.0" date="2022-07-20">
			Update the files of the User configuration templates.
			Update the files of SH3xF2xx_SB0_StdPeriph_Driver.
			Update the algorithm files for IAR.
			Delete Chip SH32F2801.
		</release>
		
		<release version="2.3.0" date="2022-02-09">
			Updated the format of PDSC file.
		</release>
		
		<release version="2.2.0" date="2022-01-05">
			Update the header files of the User configuration templates for SH3xF2xx_SB0.
			Update startup_sh32f2601_keil.s.
		</release>
	
		<release version="2.1.0" date="2021-10-08">
			Added Chip SH32F2601						
			Added Chip SH33F2801						
			Added Chip SH33F2811
			Modify sh3xf2xx_sa0_gpt.c						
		</release>
		
		<release version="2.0.0" date="2021-07-06">
		  New Architecture					
			Added Chip SH32F205						
			Added Chip SH32F284						
			Added Chip SH32F2053						
			Added Chip SH32F2801						
		</release>
	</releases>
	
  
	<keywords>
		<!-- keywords for indexing -->
    <keyword>Sinowealth</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Sinowealth</keyword>
	</keywords>

  <requirements>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  
	<!-- devices section (mandatory for Device Family Packs) -->
	<devices>
			<family Dfamily="SH3xF2xx Series" Dvendor="Sinowealth:149">
    
      <environment name="uv" >
        <CMisc>--c99</CMisc>
      </environment>    

			<description>
Sinowealth's SH3xF2 series are high-performance 32 bit MCUs based on ARM Cortex-M3 Core or ARM Star Core. Apply to all kinds of brushless DC motor (BLDC) and permanent magnet synchronous motor (PMSM). Can drive 1 to 3 completely independent three-phase DC motors.
Focusing on providing high integration and high computing power of the monolithic integrated circuit, providing a cost-effective microcontroller system solution.
			</description>
           
		<!-- ************************  Subfamily 'SH3xF2xx_SA0'  ************************ -->
		
				<!-- *****************************  Device 'SH32F205'  ***************************** -->
				<device Dname="SH32F205">		
	    		<processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
					<compile header="Device/SH3xF2xx_SA0/Include/sh32f205.h"  define="_SH32F205"/>
					<debug svd="SVD/sh32f205.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH32F205.FLM"       start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x2000"   default="1"/>

          <environment name="iar">
         		<file category="linkerfile" name="Device/SH3xF2xx_SA0/Source/IAR/sh32f205_iar.icf"/>
          </environment>  

					<description>
- Cortex-M3
- Up to 120MHz
- Flash Size:256KB, SRAM:8KB, CRAM:16KB, EEPROM:12KB, OTP:2KB
- 3 x ADC(8CHs), 1 x MACP, 2 x MCM, 4 x GPT, 1 x QEI
- 3 x OP, 3 x CMP
- 4 x Timer, 3 x UART, 2 x SPI, 1 x TWI, 16 x EXTI, 1 x CRC
- 8 channel DMA
- Up to 58 GPIOs
					</description>
     		       		
          </device>
				
				<!-- *****************************  Device 'SH32F2053'  ***************************** -->
				<device Dname="SH32F2053">			
	    		<processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
					<compile header="Device/SH3xF2xx_SA0/Include/sh32f2053.h"  define="_SH32F2053"/>
					<debug svd="SVD/sh32f2053.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH32F2053.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>

          <environment name="iar">
         		<file category="linkerfile" name="Device/SH3xF2xx_SA0/Source/IAR/sh32f2053_iar.icf"/>
         	</environment>  

					<description>
- Cortex-M3                  
- Up to 120MHz                  
- Flash Size:256KB, SRAM:8KB, CRAM:16KB, EEPROM:12KB, OTP:2KB
- 3 x ADC(8CHs), 1 x MACP, 2 x MCM, 4 x GPT, 1 x QEI 
- 3 x OP, 3 x CMP                  
- 4 x Timer, 3 x UART, 2 x SPI, 1 x TWI, 16 x EXTI, 1 x CRC
- 8 channel DMA                     
- Up to 58 GPIOs                    
				 </description>				
     		
				</device>
		  
				<!-- *****************************  Device 'SH32F284'  ***************************** -->
				<device Dname="SH32F284">		
	    		<processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dmpu="1" Dendian="Little-endian" Dclock="84000000"/>
					<compile header="Device/SH3xF2xx_SA0/Include/sh32f284.h"  define="_SH32F284"/>
					<debug svd="SVD/sh32f284.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH32F284.FLM"       start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>

          <environment name="iar">
        		 <file category="linkerfile" name="Device/SH3xF2xx_SA0/Source/IAR/sh32f284_iar.icf"/>
         	</environment> 

					<description>
- Cortex-M3
- Up to 84MHz
- Flash Size:128KB, SRAM:8KB, CRAM:16KB, EEPROM:6KB, OTP:2KB
- 2 x ADC(8CHs), 1 x MACP, 1 x MCM, 3 x GPT, 1 x QEI 
- 3 x OP, 3 x CMP
- 4 x Timer, 3 x UART, 1 x SPI, 1 x TWI, 16 x EXTI, 1 x CRC
- 8 channel DMA     
- Up to 58 GPIOs      
					</description>						
      		
				</device>

											
	<!-- *************************  End sub Family 'SH3xF2xx_SA0'  ***************************** -->


		<!-- ************************  Subfamily 'SH3xF2xx_SB0'  ************************ -->
		
				<!-- *****************************  Device 'SH32F2601'  ***************************** -->
				<device Dname="SH32F2601">		
	    		<processor Dcore="ARMV8MML" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="NO_MPU" Ddsp="NO_DSP" Dtz="NO_TZ" Dendian="Little-endian" Dclock="84000000"/>
					<compile header="Device/SH3xF2xx_SB0/Include/sh32f2601.h"  define="_SH32F2601"/>
					<debug svd="SVD/sh32f2601.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH32F2601.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"   default="1"/>

          <environment name="iar">
         		<file category="linkerfile" name="Device/SH3xF2xx_SB0/Source/IAR/sh32f2601_iar.icf"/>
          </environment>  

					<description>
- ARM STAR
- Up to 84MHz
- Flash Size:64KB, SRAM:16KB, EEPROM:4KB, OTP:1KB
- 1 x ADC(16 CHs), 1 x MACP, 1 x MCM, 2 x PCA, 1 x QEI 
- 4 x OP, 1 x CMP
- 2 x Timer, 3 x UART, 1 x SPI, 1 x TWI, 8 x EXTI, 1 x CRC
- Up to 45 GPIOs
					</description>
     		       		
          </device>
				
