XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF2xx_DFP.pdsc
				<!-- *****************************  Device 'SH33F2801'  ***************************** -->
				<device Dname="SH33F2801">			
	    		<processor Dcore="ARMV8MML" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="NO_MPU" Ddsp="DSP" Dtz="NO_TZ" Dendian="Little-endian" Dclock="84000000"/>
					<compile header="Device/SH3xF2xx_SB0/Include/sh33f2801.h"  define="_SH33F2801"/>
					<debug svd="SVD/sh33f2801.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH33F2801.FLM"      start="0x00000000"  size="0x10000000" RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>

          <environment name="iar">
         		<file category="linkerfile" name="Device/SH3xF2xx_SB0/Source/IAR/sh33f2801_iar.icf"/>
         	</environment>  

					<description>
- ARM STAR
- Up to 84MHz
- DSP and FPU
- Flash Size:128KB, SRAM:16KB, EEPROM:4KB, OTP:1KB
- 1 x ADC(16 CHs), 1 x MACP, 1 x MCM, 2 x PCA, 1 x QEI 
- 4 x OP, 1 x CMP
- 2 x Timer, 3 x UART, 1 x SPI, 1 x TWI, 8 x EXTI, 1 x CRC
- 1 x CAN 2.0B     
- Up to 45 GPIOs
				 </description>				
     		
				</device>
		  
				<!-- *****************************  Device 'SH33F2811'  ***************************** -->
				<device Dname="SH33F2811">		
	    		<processor Dcore="ARMV8MML" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="NO_MPU" Ddsp="DSP" Dtz="NO_TZ" Dendian="Little-endian" Dclock="84000000"/>
					<compile header="Device/SH3xF2xx_SB0/Include/sh33f2811.h"  define="_SH33F2811"/>
					<debug svd="SVD/sh33f2811.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH33F2811.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>

          <environment name="iar">
        		 <file category="linkerfile" name="Device/SH3xF2xx_SB0/Source/IAR/sh33f2811_iar.icf"/>
         	</environment> 

					<description>
- ARM STAR
- Up to 84MHz
- DSP and FPU
- Flash Size:128KB, SRAM:16KB, EEPROM:4KB, OTP:1KB
- 3-Half-bridge MOS/IGBT gate driver
- Built-in DC-DC, LDO
- 1 x ADC(16 CHs), 1 x MACP, 1 x MCM, 2 x PCA, 1 x QEI 
- 4 x OP, 1 x CMP
- 2 x Timer, 3 x UART, 1 x SPI, 1 x TWI, 8 x EXTI, 1 x CRC
- 1 x CAN 2.0B     
- Up to 47 GPIOs     
					</description>						
      		
				</device>

											
	<!-- *************************  End sub Family 'SH3xF2xx_SB0'  ***************************** -->


		</family>
	</devices>
	
	<!-- conditions section (optional for all Software Packs)-->
	<conditions>
		<!-- Compiler Conditions -->
		
			<condition id="ARMCC">
				<require Tcompiler="ARMCC"/>
			</condition>
			   
  		
    	<condition id="IAR">
     		<require Tcompiler="IAR"/>
   		</condition>
   		
   		<condition id="GCC">
      	<require Tcompiler="GCC"/>
    	</condition>
  	    	
        	
		<condition id="Startup ARM">
			<description>Startup assembler file for ARMCC</description>
			<require condition = "ARMCC" />
		</condition>

		<condition id="Startup GCC">
			<description>Startup assembler file for GCC</description>
			<require condition="GCC"/>
		</condition>

		<condition id="Startup IAR">
			<description>Startup assembler file for IAR</description>
			<require condition="IAR"/>
		</condition>
		    	

		<!--  SH3xF2 SA0 -->  
		
		  <condition id="SH32F205">
				<require Dname="SH32F205"/>	
	  	  <require Cclass="CMSIS"  Cgroup="CORE"/>						
	      <accept condition="ARMCC" />
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
	  </condition>

		  <condition id="SH32F2053">
				<require Dname="SH32F2053"/>
	  	 <require Cclass="CMSIS"  Cgroup="CORE"/>						
	      <accept condition="ARMCC" />
	      <accept condition="GCC" />
	      <accept condition="IAR" />							
		  </condition>

		  <condition id="SH32F284">
				<require Dname="SH32F284"/>
	  	 <require Cclass="CMSIS"  Cgroup="CORE"/>						
	      <accept condition="ARMCC" />
	      <accept condition="GCC" />
	      <accept condition="IAR" />							
		  </condition>

	    <condition id="SH3xF2_SA0">
			<description>Sinowealth SH3xF2_SA0 Series Device</description>	
	      <accept condition="SH32F205"/>          
	      <accept condition="SH32F2053"/>          
	      <accept condition="SH32F284"/>          
	    </condition>

		  <condition id="SH32F2601">
				<require Dname="SH32F2601"/>
 	  	  <require Cclass="CMSIS"  Cgroup="CORE"/>						
	      <accept condition="ARMCC" />
	      <accept condition="GCC" />
	      <accept condition="IAR" />							
		  </condition>

		  <condition id="SH33F2801">
				<require Dname="SH33F2801"/>
 	  	  <require Cclass="CMSIS"  Cgroup="CORE"/>						
	      <accept condition="ARMCC" />
	      <accept condition="GCC" />
	      <accept condition="IAR" />							
		  </condition>

		  <condition id="SH33F2811">
				<require Dname="SH33F2811"/>
 	  	  <require Cclass="CMSIS"  Cgroup="CORE"/>						
	      <accept condition="ARMCC" />
	      <accept condition="GCC" />
	      <accept condition="IAR" />							
		  </condition>

	    <condition id="SH3xF2_SB0">
			<description>Sinowealth SH3xF2_SB0 Series Device</description>	
	      <accept condition="SH32F2601"/>          
	      <accept condition="SH33F2801"/>          
	      <accept condition="SH33F2811"/>          
	    </condition>

	    <condition id="SH3xF2_SB0_CAN">
			<description>Sinowealth SH3xF2_SB0 Series Device With CAN Module</description>	
	      <accept condition="SH33F2801"/>          
	      <accept condition="SH33F2811"/>          
	    </condition>
	    
<!--  MODULE CONDITION --> 
   
   <condition id="MT Stdlib COMMON">
      <description>Sinowealth SH3xF2xx Series COMMON Driver with CMSIS</description>
	  	<require Cclass="CMSIS"  Cgroup="CORE"/>						
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>
   
   <condition id="MT Stdlib RCC">
      <description>Sinowealth SH3xF2xx Series RCC Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="COMMON" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>
   
