XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF2xx_DFP.pdsc
   <condition id="MT Stdlib GPIO">
      <description>Sinowealth SH3xF2xx Series GPIO Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>

   <condition id="MT Stdlib ADC">
      <description>Sinowealth SH3xF2xx Series ADC Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>   

   <condition id="MT Stdlib AMOC">
      <description>Sinowealth SH3xF2xx Series AMOC Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>

   <condition id="MT Stdlib CAN">
      <description>Sinowealth SH3xF2xx Series CAN Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH3xF2_SB0_CAN" />      
   </condition>

   <condition id="MT Stdlib CORE">
      <description>Sinowealth SH3xF2xx Series Additional CORE Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="COMMON" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>
   
   <condition id="MT Stdlib CRC">
      <description>Sinowealth SH3xF2xx Series CRC Driver</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>

   <condition id="MT Stdlib DMA">
      <description>Sinowealth SH3xF2xx Series DMA Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH3xF2_SA0" />
   </condition>

   <condition id="MT Stdlib EXTI">
      <description>Sinowealth SH3xF2xx Series EXTI Driver</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>

   <condition id="MT Stdlib FIFO">
      <description>Sinowealth SH3xF2xx Series FIFO Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH3xF2_SB0" />      
   </condition>

   <condition id="MT Stdlib FLASH">
      <description>Sinowealth SH3xF2xx Series FLASH Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="COMMON" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>

   <condition id="MT Stdlib GPT">
      <description>Sinowealth SH3xF2xx Series GPT Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH3xF2_SA0" />
   </condition>

   <condition id="MT Stdlib IQmath">
      <description>Sinowealth SH3xF2xx Series IQmath Driver</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>
   
   <condition id="MT Stdlib IWDT">
      <description>Sinowealth SH3xF2xx Series IWDT Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="COMMON" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>
   
   <condition id="MT Stdlib MACP">
      <description>Sinowealth SH3xF2xx Series MACP Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH3xF2_SA0" />
      <accept condition="SH3xF2_SB0" />      
   </condition>

   <condition id="MT Stdlib MCM">
      <description>Sinowealth SH3xF2xx Series MCM Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH3xF2_SA0" />
      <accept condition="SH3xF2_SB0" />      
   </condition>

   <condition id="MT Stdlib MPU">
      <description>Sinowealth SH3xF2xx Series MPU Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="COMMON" />      
      <accept condition="SH3xF2_SA0" />
   </condition>
   
   <condition id="MT Stdlib NVIC">
      <description>Sinowealth SH3xF2xx Series NVIC Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="COMMON" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>  

   <condition id="MT Stdlib PCA">
      <description>Sinowealth SH3xF2xx Series PCA Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH3xF2_SB0" />
   </condition>
   
   <condition id="MT Stdlib QEI">
      <description>Sinowealth SH3xF2xx Series QEI Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH3xF2_SA0" />
      <accept condition="SH3xF2_SB0" />      
   </condition>

   <condition id="MT Stdlib SPI">
      <description>Sinowealth SH3xF2xx Series SPI Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH3xF2_SA0" />
      <accept condition="SH3xF2_SB0" />      
   </condition>

   <condition id="MT Stdlib SYSCFG">
      <description>Sinowealth SH3xF2xx Series SYSCFG Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>

   <condition id="MT Stdlib TIMER">
      <description>Sinowealth SH3xF2xx Series TIMER Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
  </condition>

   <condition id="MT Stdlib TWI">
      <description>Sinowealth SH3xF2xx Series TWI Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
    </condition>

   <condition id="MT Stdlib UART">
      <description>Sinowealth SH3xF2xx Series UART Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>

   <condition id="MT Stdlib WWDT">
      <description>Sinowealth SH3xF2xx Series WWDT Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH3xF2_SA0" />      
      <accept condition="SH3xF2_SB0" />      
   </condition>
  	    		
