XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF2xx_DFP.pdsc
	</conditions>


		
	<!-- component section (optional for all Software Packs)-->
	<components>
		<!-- Startup SH32F205 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0" condition="SH32F205">
			<description>System Startup for SH32F205 </description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->              
				#define SH_USE_PRJ_CFG
      </RTE_Components_h>			
				<files>				
        <!-- header files -->
		     <file category="header" name="Device/SH3xF2xx_SA0/Include/sh32f205.h" />
		              
        <!-- startup file -->
				<file category="source" name="Device/SH3xF2xx_SA0/Source/ARM/startup_sh32f205_keil.s" attr="config" version="1.0.0" condition="Startup ARM"/>
				<file category="source" name="Device/SH3xF2xx_SA0/Source/GCC/startup_sh32f205_gcc.S"  attr="config" version="1.0.0" condition="Startup GCC"/>
				<file category="source" name="Device/SH3xF2xx_SA0/Source/IAR/startup_sh32f205_iar.s"  attr="config" version="1.0.0" condition="Startup IAR"/>
				
        <!-- linker file -->
       <file category="linkerScript"  name="Device/SH3xF2xx_SA0/Source/ARM/sh32f205_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
       <file category="linkerScript"  name="Device/SH3xF2xx_SA0/Source/GCC/sh32f205_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/>
       <file category="linkerScript"  name="Device/SH3xF2xx_SA0/Source/IAR/sh32f205_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

				<!-- config file -->
        <file category="header"  condition="SH32F205" name="Device/SH3xF2xx_SA0/templates/SH32F205/CFG32F205.h" attr="config" version="1.0.2"/>
        <file category="source"  condition="SH32F205" name="Device/SH3xF2xx_SA0/templates/SH32F205/CFG32F205.c" attr="config" version="1.0.2"/>

				<!-- system file -->
				<file category="source" name="Device/SH3xF2xx_SA0/Source/system_sh3xf2xx_sa0.c" attr="config" version="1.0.0"/>

			</files>
		</component>
		
			<!-- Startup SH32F2053 -->
			<component Cclass="Device" Cgroup="Startup" Cversion="2.2.0" condition="SH32F2053">
			<description>System Startup for SH32F2053 </description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->              
				#define SH_USE_PRJ_CFG
      </RTE_Components_h>			
				<files>				
        <!-- header files -->
        <file category="header" name="Device/SH3xF2xx_SA0/Include/sh32f2053.h" />
        
        <!-- startup file -->
				<file category="source" name="Device/SH3xF2xx_SA0/Source/ARM/startup_sh32f2053_keil.s" attr="config" version="1.0.0" condition="Startup ARM"/>
				<file category="source" name="Device/SH3xF2xx_SA0/Source/GCC/startup_sh32f2053_gcc.S"  attr="config" version="1.0.0" condition="Startup GCC"/>
				<file category="source" name="Device/SH3xF2xx_SA0/Source/IAR/startup_sh32f2053_iar.s"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- linker file -->
       <file category="linkerScript"  name="Device/SH3xF2xx_SA0/Source/ARM/sh32f2053_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
       <file category="linkerScript"  name="Device/SH3xF2xx_SA0/Source/GCC/sh32f2053_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/>
       <file category="linkerScript"  name="Device/SH3xF2xx_SA0/Source/IAR/sh32f2053_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>
       
 				<!-- config file -->
        <file category="header"  condition="SH32F2053" name="Device/SH3xF2xx_SA0/templates/SH32F2053/CFG32F2053.h"  attr="config" version="1.0.2"/>
        <file category="source"  condition="SH32F2053" name="Device/SH3xF2xx_SA0/templates/SH32F2053/CFG32F2053.c"  attr="config" version="1.0.2"/>

				<!-- system file -->
				<file category="source" name="Device/SH3xF2xx_SA0/Source/system_sh3xf2xx_sa0.c" attr="config" version="1.0.0"/>

			</files>
		</component>
		
		
			<!-- Startup SH32F284 -->
		<component Cclass="Device" Cgroup="Startup" Cversion="2.2.0" condition="SH32F284">
			<description>System Startup for SH32F284 </description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->              
				#define SH_USE_PRJ_CFG
      </RTE_Components_h>			
				<files>
				
        <!-- header files -->
        <file category="header" name="Device/SH3xF2xx_SA0/Include/sh32f284.h" />
        
        <!-- startup file -->
				<file category="source" name="Device/SH3xF2xx_SA0/Source/ARM/startup_sh32f284_keil.s" attr="config"  version="1.0.0" condition="Startup ARM"/>
				<file category="source" name="Device/SH3xF2xx_SA0/Source/GCC/startup_sh32f284_gcc.S"  attr="config"  version="1.0.0" condition="Startup GCC"/>
				<file category="source" name="Device/SH3xF2xx_SA0/Source/IAR/startup_sh32f284_iar.s"  attr="config"  version="1.0.0" condition="Startup IAR"/>

        <!-- linker file -->
       <file category="linkerScript"  name="Device/SH3xF2xx_SA0/Source/ARM/sh32f284_keil.sct" attr="config"  version="1.0.0" condition="Startup ARM"/>        
       <file category="linkerScript"  name="Device/SH3xF2xx_SA0/Source/GCC/sh32f284_gcc.ld"   attr="config"  version="1.0.0" condition="Startup GCC"/>
       <file category="linkerScript"  name="Device/SH3xF2xx_SA0/Source/IAR/sh32f284_iar.icf"  attr="config"  version="1.0.0" condition="Startup IAR"/>

				<!-- config file -->
        <file category="header"  condition="SH32F284" name="Device/SH3xF2xx_SA0/templates/SH32F284/CFG32F284.h"  attr="config"  version="1.0.0"/>
        <file category="source"  condition="SH32F284" name="Device/SH3xF2xx_SA0/templates/SH32F284/CFG32F284.c"  attr="config"  version="1.0.0"/>

				<!-- system file -->
				<file category="source" name="Device/SH3xF2xx_SA0/Source/system_sh3xf2xx_sa0.c" attr="config"  version="1.0.0"/>

			</files>
		</component>
		

					<!-- Startup SH32F2601 -->
		<component Cclass="Device" Cgroup="Startup" Cversion="2.2.0" condition="SH32F2601">
			<description>System Startup for SH32F2601 </description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->              
				#define SH_USE_PRJ_CFG
      </RTE_Components_h>			
				<files>
				
