XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF2xx_DFP.pdsc
        <!-- header files -->
        <file category="header" name="Device/SH3xF2xx_SB0/Include/sh32f2601.h" />
        
        <!-- startup file -->
				<file category="source" name="Device/SH3xF2xx_SB0/Source/ARM/startup_sh32f2601_keil.s" attr="config"  version="1.0.0" condition="Startup ARM"/>
				<file category="source" name="Device/SH3xF2xx_SB0/Source/GCC/startup_sh32f2601_gcc.S"  attr="config"  version="1.0.0" condition="Startup GCC"/>
				<file category="source" name="Device/SH3xF2xx_SB0/Source/IAR/startup_sh32f2601_iar.s"  attr="config"  version="1.0.0" condition="Startup IAR"/>

        <!-- linker file -->
       <file category="linkerScript"  name="Device/SH3xF2xx_SB0/Source/ARM/sh32f2601_keil.sct" attr="config"  version="1.0.0" condition="Startup ARM"/>        
       <file category="linkerScript"  name="Device/SH3xF2xx_SB0/Source/GCC/sh32f2601_gcc.ld"   attr="config"  version="1.0.0" condition="Startup GCC"/>
       <file category="linkerScript"  name="Device/SH3xF2xx_SB0/Source/IAR/sh32f2601_iar.icf"  attr="config"  version="1.0.0" condition="Startup IAR"/>

				<!-- config file -->
        <file category="header"  condition="SH32F2601" name="Device/SH3xF2xx_SB0/templates/SH32F2601/CFG32F2601.h"  attr="config" version="1.0.0"/>
        <file category="source"  condition="SH32F2601" name="Device/SH3xF2xx_SB0/templates/SH32F2601/CFG32F2601.c"  attr="config" version="1.0.0"/>

				<!-- system file -->
				<file category="source" name="Device/SH3xF2xx_SB0/Source/system_sh3xf2xx_sb0.c" attr="config" version="1.0.0"/>

			</files>
		</component>
	

					<!-- Startup SH33F2801 -->
		<component Cclass="Device" Cgroup="Startup" Cversion="2.2.0" condition="SH33F2801">
			<description>System Startup for SH33F2801 </description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->              
				#define SH_USE_PRJ_CFG
      </RTE_Components_h>			
				<files>
				
        <!-- header files -->
        <file category="header" name="Device/SH3xF2xx_SB0/Include/sh33f2801.h" />
        
        <!-- startup file -->
				<file category="source" name="Device/SH3xF2xx_SB0/Source/ARM/startup_sh33f2801_keil.s" attr="config"  version="1.0.0" condition="Startup ARM"/>
				<file category="source" name="Device/SH3xF2xx_SB0/Source/GCC/startup_sh33f2801_gcc.S"  attr="config"  version="1.0.0" condition="Startup GCC"/>
				<file category="source" name="Device/SH3xF2xx_SB0/Source/IAR/startup_sh33f2801_iar.s"  attr="config"  version="1.0.0" condition="Startup IAR"/>

        <!-- linker file -->
       <file category="linkerScript"  name="Device/SH3xF2xx_SB0/Source/ARM/sh33f2801_keil.sct" attr="config"  version="1.0.0" condition="Startup ARM"/>        
       <file category="linkerScript"  name="Device/SH3xF2xx_SB0/Source/GCC/sh33f2801_gcc.ld"   attr="config"  version="1.0.0" condition="Startup GCC"/>
       <file category="linkerScript"  name="Device/SH3xF2xx_SB0/Source/IAR/sh33f2801_iar.icf"  attr="config"  version="1.0.0" condition="Startup IAR"/>

				<!-- config file -->
        <file category="header"  condition="SH33F2801" name="Device/SH3xF2xx_SB0/templates/SH33F2801/CFG33F2801.h"  attr="config" version="1.0.0"/>
        <file category="source"  condition="SH33F2801" name="Device/SH3xF2xx_SB0/templates/SH33F2801/CFG33F2801.c"  attr="config" version="1.0.0"/>

				<!-- system file -->
				<file category="source" name="Device/SH3xF2xx_SB0/Source/system_sh3xf2xx_sb0.c" attr="config" version="1.0.0"/>

			</files>
		</component>


					<!-- Startup SH33F2811 -->
		<component Cclass="Device" Cgroup="Startup" Cversion="2.2.0" condition="SH33F2811">
			<description>System Startup for SH33F2811 </description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->              
				#define SH_USE_PRJ_CFG
      </RTE_Components_h>			
				<files>
				
        <!-- header files -->
        <file category="header" name="Device/SH3xF2xx_SB0/Include/sh33f2811.h" />
        
        <!-- startup file -->
				<file category="source" name="Device/SH3xF2xx_SB0/Source/ARM/startup_sh33f2811_keil.s" attr="config"  version="1.0.0" condition="Startup ARM"/>
				<file category="source" name="Device/SH3xF2xx_SB0/Source/GCC/startup_sh33f2811_gcc.S"  attr="config"  version="1.0.0" condition="Startup GCC"/>
				<file category="source" name="Device/SH3xF2xx_SB0/Source/IAR/startup_sh33f2811_iar.s"  attr="config"  version="1.0.0" condition="Startup IAR"/>

        <!-- linker file -->
       <file category="linkerScript"  name="Device/SH3xF2xx_SB0/Source/ARM/sh33f2811_keil.sct" attr="config"  version="1.0.0" condition="Startup ARM"/>        
       <file category="linkerScript"  name="Device/SH3xF2xx_SB0/Source/GCC/sh33f2811_gcc.ld"   attr="config"  version="1.0.0" condition="Startup GCC"/>
       <file category="linkerScript"  name="Device/SH3xF2xx_SB0/Source/IAR/sh33f2811_iar.icf"  attr="config"  version="1.0.0" condition="Startup IAR"/>

				<!-- config file -->
        <file category="header"  condition="SH33F2811" name="Device/SH3xF2xx_SB0/templates/SH33F2811/CFG33F2811.h"  attr="config" version="1.0.0"/>
        <file category="source"  condition="SH33F2811" name="Device/SH3xF2xx_SB0/templates/SH33F2811/CFG33F2811.c"  attr="config" version="1.0.0"/>

				<!-- system file -->
				<file category="source" name="Device/SH3xF2xx_SB0/Source/system_sh3xf2xx_sb0.c" attr="config" version="1.0.0"/>

			</files>
		</component>
		
			<component Cclass="Sino32StdPeripherals" Cgroup="COMMON" Cversion="1.1.0" condition="MT Stdlib COMMON">
			<description></description>
			<RTE_Components_h>
        	#define SH_USE_MODULE_LIB
      </RTE_Components_h>
			<files>
			  
				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_lib.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_lib.h" attr="config" version="1.0.0" condition="SH3xF2_SB0"/>
			
			</files>
		</component>

		
		<component Cclass="Sino32StdPeripherals" Cgroup="ADC" Cversion="1.1.0" condition="MT Stdlib ADC">
			<description>ADC driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_ADC
      </RTE_Components_h>
			<files>

				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_adc.h" attr="config"  version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_adc.c" attr="config"  version="1.1.0" condition="SH3xF2_SA0"/>

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_adc.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_adc.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>

		
