XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF2xx_DFP.pdsc
		<component Cclass="Sino32StdPeripherals" Cgroup="AMOC" Cversion="1.1.0" condition="MT Stdlib AMOC">
			<description>Analog-module-on-chip (AMOC) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_AMOC
      </RTE_Components_h>
			<files>
				
				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_amoc.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_amoc.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>				

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_amoc.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_amoc.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>


     <component Cclass="Sino32StdPeripherals" Cgroup="CAN" Cversion="1.1.0" condition="MT Stdlib CAN">
      <description>CAN driver of Sino32 Stdlib</description>
      <RTE_Components_h>
       	#define RTE_MODULE_CAN
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_can.h" attr="config" version="1.1.0" condition="SH3xF2_SB0" />
        <file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_can.c" attr="config" version="1.1.0" condition="SH3xF2_SB0" />        
      </files>
    </component>  


		<component Cclass="Sino32StdPeripherals" Cgroup="CORE" Cversion="1.1.0" condition="MT Stdlib CORE">
			<description>Core special functions driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_CORTEX
      </RTE_Components_h>
			<files>

				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_core.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_core.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_core.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_core.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>

		
		<component Cclass="Sino32StdPeripherals" Cgroup="CRC" Cversion="1.1.0" condition="MT Stdlib CRC">
			<description>Cyclic-redundancy-check (CRC) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_CRC
      </RTE_Components_h>
			<files>

				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_crc.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_crc.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_crc.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_crc.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>


     <component Cclass="Sino32StdPeripherals" Cgroup="DMA" Cversion="1.1.0" condition="MT Stdlib DMA">
      <description>Direct-memory-access (DMA) driver of Sino32 Stdlib</description>
      <RTE_Components_h>
       	#define RTE_MODULE_DMA
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_dma.h" attr="config" version="1.1.0" condition="SH3xF2_SA0" />
        <file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_dma.c" attr="config" version="1.1.0" condition="SH3xF2_SA0" />        
      </files>
    </component>    


		<component Cclass="Sino32StdPeripherals" Cgroup="EXTI" Cversion="1.1.0" condition="MT Stdlib EXTI">
			<description>External-Interrupt (EXTI) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_EXTI
      </RTE_Components_h>
			<files>

				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_exti.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_exti.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_exti.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_exti.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>


		<component Cclass="Sino32StdPeripherals" Cgroup="FIFO" Cversion="1.1.0" condition="MT Stdlib FIFO">
			<description>FIFO driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_FIFO
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_fifo.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_fifo.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
			</files>
		</component>

		
		<component Cclass="Sino32StdPeripherals" Cgroup="FLASH" Cversion="1.1.0" condition="MT Stdlib FLASH">
			<description>Flash memory programming driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_FLASH
      </RTE_Components_h>
			<files>
				
				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_flash.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_flash.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>				

