XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF2xx_DFP.pdsc
				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_flash.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_flash.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>

		
		<component Cclass="Sino32StdPeripherals" Cgroup="GPIO" Cversion="1.1.0" condition="MT Stdlib GPIO">
			<description>General-purpose-input-and-output (GPIO) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_GPIO
      </RTE_Components_h>
			<files>
				
				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_gpio.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_gpio.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>				

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_gpio.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_gpio.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>


     <component Cclass="Sino32StdPeripherals" Cgroup="GPT" Cversion="1.1.0" condition="MT Stdlib GPT">
      <description>GPT driver of Sino32 Stdlib</description>
      <RTE_Components_h>
        #define RTE_MODULE_GPT
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_gpt.h" attr="config" version="1.1.0" condition="SH3xF2_SA0" />
        <file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_gpt.c" attr="config" version="1.1.0" condition="SH3xF2_SA0" />
       </files>
    </component>  


		<component Cclass="Sino32StdPeripherals" Cgroup="IQmath" Cversion="1.1.0" condition="MT Stdlib IQmath">
			<description>IQmath driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_IQMATH
      </RTE_Components_h>
			<files>

				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_IQmath.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_IQmath.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>				

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_IQmath.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_IQmath.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>


		<component Cclass="Sino32StdPeripherals" Cgroup="IWDT" Cversion="1.1.0" condition="MT Stdlib IWDT">
			<description>IWDT driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_IWDT
      </RTE_Components_h>
			<files>

				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_iwdt.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_iwdt.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_iwdt.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_iwdt.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>

		
		<component Cclass="Sino32StdPeripherals" Cgroup="MACP" Cversion="1.1.0" condition="MT Stdlib MACP">
			<description>Mathematic-coprocessor (MACP) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_MACP
      </RTE_Components_h>
			<files>
				
				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_macp.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_macp.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>								

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_macp.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_macp.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>


		<component Cclass="Sino32StdPeripherals" Cgroup="MCM" Cversion="1.1.0" condition="MT Stdlib MCM">
			<description>Motor-control-module (MCM) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_MCM
      </RTE_Components_h>
			<files>

				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_mcm.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_mcm.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>								

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_mcm.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_mcm.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>


     <component Cclass="Sino32StdPeripherals" Cgroup="MPU" Cversion="1.1.0" condition="MT Stdlib MPU">
      <description>Memory-protection-unit (MPU) driver of Sino32 Stdlib</description>
      <RTE_Components_h>
        #define RTE_MODULE_MPU
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_mpu.h" attr="config" version="1.1.0" condition="SH3xF2_SA0" />
        <file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_mpu.c" attr="config" version="1.1.0" condition="SH3xF2_SA0" />
       </files>
    </component>  

		
		<component Cclass="Sino32StdPeripherals" Cgroup="NVIC" Cversion="1.1.0" condition="MT Stdlib NVIC">
			<description>Additional Nested-vectored-interrupt-controller (NVIC) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_NVIC
      </RTE_Components_h>
			<files>
				
