XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF2xx_DFP.pdsc
				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_nvic.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_nvic.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>												

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_nvic.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_nvic.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>


		<component Cclass="Sino32StdPeripherals" Cgroup="PCA" Cversion="1.1.0" condition="MT Stdlib PCA">
			<description>PCA driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_PCA
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_pca.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_pca.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
			</files>
		</component>



		<component Cclass="Sino32StdPeripherals" Cgroup="QEI" Cversion="1.1.0" condition="MT Stdlib QEI">
			<description>Quadrature-encoder-interface (QEI) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_QEI
      </RTE_Components_h>
			<files>
			
				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_qei.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_qei.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>												

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_qei.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_qei.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>


		<component Cclass="Sino32StdPeripherals" Cgroup="RCC" Cversion="1.1.0" condition="MT Stdlib RCC">
			<description>Reset-and-clock-control (RCC) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_RCC
      </RTE_Components_h>
			<files>

				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_rcc.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_rcc.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>												

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_rcc.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_rcc.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>


		<component Cclass="Sino32StdPeripherals" Cgroup="SPI" Cversion="1.1.0" condition="MT Stdlib SPI">
			<description>Serial Peripheral Interface (SPI) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_SPI
      </RTE_Components_h>
			<files>
				
				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_spi.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_spi.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>																

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_spi.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_spi.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>


		<component Cclass="Sino32StdPeripherals" Cgroup="SYSCFG" Cversion="1.1.0" condition="MT Stdlib SYSCFG">
			<description>System configuration (SYSCFG) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_SYSCFG
      </RTE_Components_h>
			<files>
			
				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_syscfg.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_syscfg.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>																

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_syscfg.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_syscfg.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>		


		<component Cclass="Sino32StdPeripherals" Cgroup="TIMER" Cversion="1.1.0" condition="MT Stdlib TIMER">
			<description>General Timer driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_TIMER
      </RTE_Components_h>
			<files>
				
				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_tim.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_tim.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>																

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_tim.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_tim.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>		

		
		<component Cclass="Sino32StdPeripherals" Cgroup="TWI" Cversion="1.1.0" condition="MT Stdlib TWI">
			<description>Two-wire-serial-interface (TWI) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_TWI
      </RTE_Components_h>
			<files>
				
				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_twi.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_twi.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>																

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_twi.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_twi.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>


