XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF2xx_DFP.pdsc
		<component Cclass="Sino32StdPeripherals" Cgroup="UART" Cversion="1.1.0" condition="MT Stdlib UART">
			<description>Universal-asynchronous-receiver-transmitter (UART) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_UART
      </RTE_Components_h>
			<files>
				
				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_uart.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_uart.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>																

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_uart.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_uart.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>
		
		
		<component Cclass="Sino32StdPeripherals" Cgroup="WWDT" Cversion="1.1.0" condition="MT Stdlib WWDT">
			<description>Window-watchdog-timer (WWDT) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_WWDT
      </RTE_Components_h>
			<files>

				<file category="header" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/inc/sh3xf2xx_sa0_wwdt.h" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>
				<file category="source" name="Device/SH3xF2xx_SA0_StdPeriph_Driver/src/sh3xf2xx_sa0_wwdt.c" attr="config" version="1.1.0" condition="SH3xF2_SA0"/>																

				<file category="header" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/inc/sh3xf2xx_sb0_wwdt.h" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>
				<file category="source" name="Device/SH3xF2xx_SB0_StdPeriph_Driver/src/sh3xf2xx_sb0_wwdt.c" attr="config"  version="1.0.0" condition="SH3xF2_SB0"/>

			</files>
		</component>

		<!-- END: Sino_MT Standard Peripherals Drivers -->
		

			
		<!-- END: Project Config  -->
			
		<!-- START: Project Template  -->	
		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH3xF2_SA0">
			<description>Project Template for SH3xF2_SA0 </description>
			<files>      
        <file category="header" name="Device/SH3xF2xx_SA0/templates/sh3xf2xx_sa0_int.h"   attr="config" version="1.1.0"/>								
        <file category="source" name="Device/SH3xF2xx_SA0/templates/sh3xf2xx_sa0_int.c"   attr="config" version="1.1.0"/>
        <file category="source" name="Device/SH3xF2xx_SA0/templates/sh3xf2xx_sa0_main.c"  attr="config" version="1.1.0"/>
     </files>
		</component>

		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH3xF2_SB0">
			<description>Project Template for SH3xF2_SB0 </description>
			<files>      
        <file category="header" name="Device/SH3xF2xx_SB0/templates/sh3xf2xx_sb0_int.h"   attr="config" version="1.1.0"/>								
        <file category="source" name="Device/SH3xF2xx_SB0/templates/sh3xf2xx_sb0_int.c"   attr="config" version="1.1.0"/>
        <file category="source" name="Device/SH3xF2xx_SB0/templates/sh3xf2xx_sb0_main.c"  attr="config" version="1.1.0"/>
     </files>
		</component>

		<!-- END: Project Template -->				
										
	</components>
		
        
</package>



